test/golden/multiple-definitions.dot
digraph 
{
  "mailgun"
  "main-app"
  "media-proxy"
  "opensearch"
  "otel-tracing"
  "s3"
  "user-registry"
  "host"
  "pngquant"
  "main-app" -> "mailgun"
  "main-app" -> "media-proxy"
  "main-app" -> "otel-tracing"
  "main-app" -> "s3"
  "main-app" -> "user-registry"
  "media-proxy" -> "mailgun"
  "media-proxy" -> "opensearch"
  "media-proxy" -> "otel-tracing"
  "media-proxy" -> "host"
  "media-proxy" -> "pngquant"
}
